benchmark/wrk.log
Running 10m test @ http://172.31.14.187:10000/286
  10 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.63ms   19.57ms 283.77ms   70.80%
    Req/Sec   198.08    231.42     2.62k    96.46%
  1117285 requests in 10.00m, 144.91MB read
Requests/sec:   1861.85
Transfer/sec:    247.28KB
Running 10m test @ http://172.31.14.187:20000/286
  10 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.48ms   20.84ms 289.42ms   61.66%
    Req/Sec   175.88    119.58     1.07k    92.31%
  998853 requests in 10.00m, 129.55MB read
Requests/sec:   1664.48
Transfer/sec:    221.06KB
Running 10m test @ http://172.31.14.187:30000/286
  10 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.50ms   19.68ms 285.98ms   66.63%
    Req/Sec   188.68    196.27     3.60k    96.13%
  1071398 requests in 10.00m, 138.96MB read
Requests/sec:   1785.36
Transfer/sec:    237.12KB
Running 10m test @ http://172.31.14.187:10000/286
  10 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.40ms    9.56ms 234.54ms   99.46%
    Req/Sec   201.00    301.82     4.48k    95.85%
  936261 requests in 10.00m, 121.43MB read
Requests/sec:   1560.22
Transfer/sec:    207.22KB
Running 10m test @ http://172.31.14.187:20000/286
  10 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.10ms    5.05ms 231.48ms   97.22%
    Req/Sec   195.63    241.31     4.00k    91.75%
  266067 requests in 10.00m, 34.51MB read
  Socket errors: connect 10, read 0, write 0, timeout 0
Requests/sec:    443.37
Transfer/sec:     58.89KB
Running 10m test @ http://172.31.14.187:30000/286
  10 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.26ms    4.32ms 228.29ms   95.62%
    Req/Sec   177.89    202.07     2.10k    95.97%
  235092 requests in 10.00m, 30.49MB read
  Socket errors: connect 10, read 0, write 0, timeout 0
Requests/sec:    391.76
Transfer/sec:     52.03KB
Running 10m test @ http://172.31.14.187:10000/286
  5 threads and 5 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.54ms   10.91ms 229.58ms   99.34%
    Req/Sec   411.64    569.84     4.55k    94.64%
  1000645 requests in 10.00m, 129.78MB read
Requests/sec:   1667.64
Transfer/sec:    221.48KB
Running 10m test @ http://172.31.14.187:20000/286
  5 threads and 5 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.89ms    5.06ms 232.60ms   99.86%
    Req/Sec   574.12    688.49     4.01k    84.17%
  136877 requests in 10.00m, 17.75MB read
  Socket errors: connect 5, read 0, write 0, timeout 0
Requests/sec:    228.10
Transfer/sec:     30.29KB
Running 10m test @ http://172.31.14.187:30000/286
  5 threads and 5 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.08ms    2.99ms 226.35ms   98.67%
    Req/Sec   324.11    322.19     2.61k    96.86%
  87376 requests in 10.00m, 11.33MB read
  Socket errors: connect 5, read 0, write 0, timeout 0
Requests/sec:    145.61
Transfer/sec:     19.34KB
Running 10m test @ http://172.31.14.187:10000/286
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.18ms   17.20ms 232.05ms   98.39%
    Req/Sec     1.40k     1.42k    4.57k    74.80%
  1423029 requests in 10.00m, 184.57MB read
Requests/sec:   2371.51
Transfer/sec:    314.97KB
Running 10m test @ http://172.31.14.187:20000/286
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   288.28us    2.72ms 233.85ms   99.96%
    Req/Sec   807.90    782.92     4.08k    90.80%
  69303 requests in 10.00m, 8.99MB read
  Socket errors: connect 2, read 0, write 0, timeout 0
Requests/sec:    115.49
Transfer/sec:     15.34KB
Running 10m test @ http://172.31.14.187:30000/286
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   271.11us    2.86ms 230.19ms   99.72%
    Req/Sec     1.05k     1.06k    4.38k    83.62%
  37222 requests in 10.00m, 4.83MB read
  Socket errors: connect 2, read 0, write 0, timeout 0
Requests/sec:     62.03
Transfer/sec:      8.24KB
Running 10m test @ http://172.31.14.187:10000/286
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   285.12us    4.42ms 230.01ms   99.89%
    Req/Sec     4.44k   298.18     4.61k    99.16%
  2579995 requests in 10.00m, 334.62MB read
Requests/sec:   4299.86
Transfer/sec:    571.08KB
Running 10m test @ http://172.31.14.187:20000/286
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   187.10us  137.21us  30.27ms   99.31%
    Req/Sec     3.91k   109.87     4.09k    75.57%
  2337102 requests in 10.00m, 303.12MB read
Requests/sec:   3894.52
Transfer/sec:    517.24KB
Running 10m test @ http://172.31.14.187:30000/286
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.06ms   26.66ms 231.46ms   96.28%
    Req/Sec     2.10k     1.82k    4.83k    63.77%
  1062066 requests in 10.00m, 137.75MB read
Requests/sec:   1769.91
Transfer/sec:    235.07KB
Running 10m test @ http://172.31.14.187:10000/286
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.84ms    3.79ms 231.03ms   82.50%
    Req/Sec     1.28k     2.17k   16.07k    97.28%
  755033 requests in 10.00m, 97.93MB read
Requests/sec:   1258.38
Transfer/sec:    167.13KB
Running 10m test @ http://172.31.14.187:20000/286
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.38ms    3.92ms 230.65ms   69.30%
    Req/Sec     1.11k     1.19k    6.59k    94.48%
  651981 requests in 10.00m, 84.56MB read
Requests/sec:   1086.58
Transfer/sec:    144.31KB
Running 10m test @ http://172.31.14.187:30000/286
  1 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.30ms    4.03ms 231.85ms   84.46%
    Req/Sec     1.13k     1.60k   14.21k    97.61%
  670324 requests in 10.00m, 86.94MB read
Requests/sec:   1117.10
Transfer/sec:    148.36KB
Running 10m test @ http://172.31.14.187:10000/286
  1 threads and 5 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.86ms    5.31ms 229.07ms   99.85%
    Req/Sec     1.33k     2.07k   12.30k    95.09%
  787599 requests in 10.00m, 102.15MB read
Requests/sec:   1312.45
Transfer/sec:    174.31KB
Running 10m test @ http://172.31.14.187:20000/286
  1 threads and 5 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.03ms    4.55ms 228.50ms   99.89%
    Req/Sec     1.14k     1.21k    6.35k    93.43%
  676961 requests in 10.00m, 87.80MB read
Requests/sec:   1128.25
Transfer/sec:    149.85KB
Running 10m test @ http://172.31.14.187:30000/286
  1 threads and 5 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.92ms    4.96ms 229.93ms   99.67%
    Req/Sec     1.24k     1.78k   11.85k    94.92%
  737063 requests in 10.00m, 95.60MB read
Requests/sec:   1228.33
Transfer/sec:    163.14KB
Running 10m test @ http://172.31.14.187:10000/286
  1 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.18ms   20.80ms 230.99ms   97.68%
    Req/Sec     3.08k     2.58k    7.47k    75.88%
  1724932 requests in 10.00m, 223.72MB read
Requests/sec:   2874.67
Transfer/sec:    381.79KB
Running 10m test @ http://172.31.14.187:20000/286
  1 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   581.28us  499.68us   2.57ms   65.89%
    Req/Sec     1.12k     1.21k    6.04k    93.89%
  54869 requests in 10.00m, 7.12MB read
  Socket errors: connect 2, read 0, write 0, timeout 0
Requests/sec:     91.43
Transfer/sec:     12.14KB
Running 10m test @ http://172.31.14.187:30000/286
  1 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms   11.11ms 230.25ms   99.28%
    Req/Sec     1.33k     1.71k    8.53k    90.65%
  786522 requests in 10.00m, 102.01MB read
Requests/sec:   1310.77
Transfer/sec:    174.09KB